Revit 2027 API
ExternalDefinitionCreationOptions Properties
The ExternalDefinitionCreationOptions type exposes the following members.
Properties
Name | Description
Description |  The description of the parameter definition to be created. The description will be used as tooltip in the Revit UI including in the properties palette. The default is an empty string.
GUID |  The GUID to use for this parameter definition. If not explicitly set, a random GUID is used.
HideWhenNoValue |  This property indicates whether this parameter should be hidden from the properties palette when it doesn't have a value.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The name of the parameter definition to be created.
UserModifiable |  This property indicates whether this parameter can be modified by UI user or not.
Visible |  True if the parameter is visible to the user, false if it is hidden and accessible only via the API. The default is true.
Top
See Also
Reference
ExternalDefinitionCreationOptions Class
Autodesk.Revit.DB Namespace